app/controllers/api/v1/auth_controller.rb

    def create
        @user = User.find_by(username: login_params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "KrissieD1984"], ["LIMIT", 1]]