app/controllers/activities_controller.rb

SELECT "activities".* FROM "activities"
---
    def index
        render json: Activity.all, status: :ok

INSERT INTO "activities" ("name", "minutes", "notes", "yoga_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "yoga"], ["minutes", 20], ["notes", "Tight"], ["yoga_type", "Flow"], ["created_at", "2022-01-28 02:13:06.330541"], ["updated_at", "2022-01-28 02:13:06.330541"]]
---
    def create
        activity = Activity.create!(activity_params)

DELETE FROM "activities" WHERE "activities"."id" = $1  [["id", 4]]
---
    def destroy
        activity = find_activity
        activity.destroy

SELECT "activities".* FROM "activities" WHERE "activities"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def find_activity
        Activity.find(params[:id])